Revit 2026 API

# BRepBuilderSurfaceGeometry Properties

---

The BRepBuilderSurfaceGeometry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

BRepBuilderSurfaceGeometry Class

Autodesk.Revit.DB Namespace